package forLesson;
	// не може наслідуватись від класів тільки імплементувати інтерфейси
public enum Transport {
	
	
	// константи не можна перераховувати після методів 
	
	
	// константи разом з значеннями, значення записуються тому що ми внесли їх в конструктор
	// у кожної константи перераховуваного типу є власна копія змінної speed, що дає можливість 
	// визначати швидкість конкретного транспорту 
	CAR(65), TRUCK(55), AIROPLANE(600), TRAIN(70), BOAT(22);

	// поля енума бажано видиляти як приватні 
	// змінна екземпляра використовується для для зберігання швидкості руху транспорту
	private int speed;

	// конструктор енума повинен завжди бути приватним
	// передаем в конструктор значення швидкості
	private Transport(int speed) {
		this.speed = speed;
	}
	// гет метод для поля енума
	public int getSpeed() {
		return speed;
	}
	

}
